#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teste-carla/novo-workspace/runs/run-cpExUEMTKHfwxWEy

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
aws_eks_cluster.tech: Refreshing state... [id=tech]
aws_eks_cluster.tech: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eks_cluster.tech has been deleted
  - resource "aws_eks_cluster" "tech" {
      - certificate_authority = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJSjBRVlFaMWhCQkF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1UVXlNREUxTURKYUZ3MHpOREE1TVRNeU1ESXdNREphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURrTi9pMzRlcE9Ibjl4eEcvRGIzMTZvZjVUbFgxeFIwSjEwZ2FNRGd3RXAwME9YUmRZdUtsdVZSREMKNzNyVTJwUHlTc0xZTlg1V3Vad3pjRlg2OWljUlVTb250N2k2TkNBUmdMNjI2a0NvWTRkc1JYS2Z5WWZUOGZpawozbnhvMjRreHlQZ0MvMWpVZmpHeUpDc3FnZXp0KyszS1FSMlV0MGtKb3VCWFlOQ0xoSloveEdzMU9BTWF0WWt3CmhxbHBNS1NnUFpLVHJxYkloM05pMmZMb2Q4MG41d2NSaWZRODRTdkdDbDdYYmxSRGU1ajc5c0ozdDJkNWlNTGQKeDV1SmhsdU5ITjZXLzdMYjU1WnhTb1J1UzhNOFNwNHgxU0xNM09wQWxvVUp1REpDd3hROVRGdGFJeldPeG5xcQpCTnhDTHEvQTFwcTZYVVVqQk12RXdLTXVQa2ZmQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRV1NFR3Qxc01KYlVMa3JWby9Sa212UW9VS1VqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQkJ0Nlo0ekVoNApQR1FHc2UxckpmU1Q4eEV2R2Rod2dkR3BLQXlVY2EwN05tTWswNWxTdkc4TUNqTnFZWERrYUxUeGc1b1dqMVNXCjNXZkNJU1oycElkNk42V1h0TTZqWWY2Nkd2YVhTWGJGMVNkU0FONzM3cWF1QWI1NWwyS2hhd0E0TTlNTHFEMGEKbHdwVjZRVFRON2EwWUk5NmNyVktVUHp1YSsrTUlNdTl2QzF3Ly9YOGVGQ1VWZnRnMGlvT2Q0aHFmMGxvVmg4SgpReGd1MWxleXkzTUk4VEhzVzFML1BVVm94ZVBSZmdGblVpbFFJKzNESHduTlh6ZVMxUE9ER1MxSmhhNXoxT05mCmFDRmc2SFlSdWhXeW80VU1IeGZibTZocUkxN3hsWFBhcEJKV0NzaExseTBtVllqSDZNV1cxcGxFWWJtNGFyYVEKeS9hZUJjbnhvQzh0Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint              = "https://8A5F28BA242A61F9CBD527C41717F479.gr7.us-east-1.eks.amazonaws.com" -> null
        id                    = "tech"
      - name                  = "tech" -> null
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.tech will be created
  + resource "aws_eks_cluster" "tech" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "tech"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::019248244455:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-0291d82d4138268a6",
              + "subnet-04587582b33e4ce96",
              + "subnet-09be1855303d6deed",
              + "subnet-09e2059bbc3ec7028",
              + "subnet-0b3fa0d2fc429e633",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.techNode will be created
  + resource "aws_eks_node_group" "techNode" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "techNode"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::019248244455:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0291d82d4138268a6",
          + "subnet-04587582b33e4ce96",
          + "subnet-09be1855303d6deed",
          + "subnet-09e2059bbc3ec7028",
          + "subnet-0b3fa0d2fc429e633",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ endpoint                              = "https://8A5F28BA242A61F9CBD527C41717F479.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
  ~ kubeconfig-certificate-authority-data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJSjBRVlFaMWhCQkF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1UVXlNREUxTURKYUZ3MHpOREE1TVRNeU1ESXdNREphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURrTi9pMzRlcE9Ibjl4eEcvRGIzMTZvZjVUbFgxeFIwSjEwZ2FNRGd3RXAwME9YUmRZdUtsdVZSREMKNzNyVTJwUHlTc0xZTlg1V3Vad3pjRlg2OWljUlVTb250N2k2TkNBUmdMNjI2a0NvWTRkc1JYS2Z5WWZUOGZpawozbnhvMjRreHlQZ0MvMWpVZmpHeUpDc3FnZXp0KyszS1FSMlV0MGtKb3VCWFlOQ0xoSloveEdzMU9BTWF0WWt3CmhxbHBNS1NnUFpLVHJxYkloM05pMmZMb2Q4MG41d2NSaWZRODRTdkdDbDdYYmxSRGU1ajc5c0ozdDJkNWlNTGQKeDV1SmhsdU5ITjZXLzdMYjU1WnhTb1J1UzhNOFNwNHgxU0xNM09wQWxvVUp1REpDd3hROVRGdGFJeldPeG5xcQpCTnhDTHEvQTFwcTZYVVVqQk12RXdLTXVQa2ZmQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRV1NFR3Qxc01KYlVMa3JWby9Sa212UW9VS1VqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQkJ0Nlo0ekVoNApQR1FHc2UxckpmU1Q4eEV2R2Rod2dkR3BLQXlVY2EwN05tTWswNWxTdkc4TUNqTnFZWERrYUxUeGc1b1dqMVNXCjNXZkNJU1oycElkNk42V1h0TTZqWWY2Nkd2YVhTWGJGMVNkU0FONzM3cWF1QWI1NWwyS2hhd0E0TTlNTHFEMGEKbHdwVjZRVFRON2EwWUk5NmNyVktVUHp1YSsrTUlNdTl2QzF3Ly9YOGVGQ1VWZnRnMGlvT2Q0aHFmMGxvVmg4SgpReGd1MWxleXkzTUk4VEhzVzFML1BVVm94ZVBSZmdGblVpbFFJKzNESHduTlh6ZVMxUE9ER1MxSmhhNXoxT05mCmFDRmc2SFlSdWhXeW80VU1IeGZibTZocUkxN3hsWFBhcEJKV0NzaExseTBtVllqSDZNV1cxcGxFWWJtNGFyYVEKeS9hZUJjbnhvQzh0Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @carla-gb, Action: `pull_request`*